Revit 2024 API
ParameterTypeId.AnalyticalMemberRotation Property
 "Cross-Section Rotation": Used for Analytical Member
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId AnalyticalMemberRotation { get; }
Visual Basic
Public Shared ReadOnly Property AnalyticalMemberRotation As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ AnalyticalMemberRotation {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace